app/services/products/import_from_csv_service.rb

INSERT INTO "products" ("sku","upc","name","description","price","model_number","primary_category","secondary_category","created_at","updated_at") VALUES ('786987605', '123140', 'Frilly Pillow', 'Synthetic', 19.99, '15587', 'Living Room', 'Textile', STRFTIME('%Y-%m-%d %H:%M:%f', 'NOW'), STRFTIME('%Y-%m-%d %H:%M:%f', 'NOW')), ('001-74227', '123143', 'Carpet', 'Polyester', 290.99, 'M-590X', 'Apartment', 'Textile', STRFTIME('%Y-%m-%d %H:%M:%f', 'NOW'), STRFTIME('%Y-%m-%d %H:%M:%f', 'NOW')) ON CONFLICT  DO NOTHING RETURNING "id","sku","upc","name","description","price","model_number","primary_category","secondary_category"
---
    def bulk_insert
      binding.irb
      ActiveRecord::Base.transaction do
        Product.insert_all(
          transform_parsed_csv,
          returning: %w[
            id sku upc name description price
            model_number primary_category secondary_category
          ]
        )